{
"About": {
  "Name": "Isaac J. Fuchs",
  "Currently": "Computer Engineering Student",
  "Headshot": "Isaacpick4.jpg",
  "Thumbnail": "Isaacpick4.jpg",
  "AboutText": "Hello, I am Isaac Fuchs. I am a computer engineering student at Seattle Pacific University. I am focused on learning physical electronics and various python based coding languages."
},
"Contact": {
  "EMail": "fuchsi@spu.edu",
  "Phone": "https://www.linkedin.com/in/isaac-fuchs/",
  "Portfolio": "https://isaac-fuchs.github.io/Isaac_Fuchs_Portfolio.github.io/index.html",
  "LinkedIn": "https://www.linkedin.com/in/isaac-fuchs/"
  "GitHub": "https://github.com/Isaac-Fuchs"
},
"Experience": {
  "ExperienceText": " ",
  "School": "Seattle Pacific University",
  "Major": "Computer Engineering",
  "Graduation": "June 2027",
  "EducationText": "I received my direct transfer agreement AA from Spokane Falls Community College (SFCC) in 2024 through running start. I focused on the general requirments at SFCC to prepare myself for full time college, as I had not yet decided on the exact degree I was going to work towards.",
  "Employment": "Sudexo ",
  "Role": "Catering Staff Member",
  "EmploymentText": "I have worked a large varriety of jobs, from lifeguarding to being a caretaker at a child care center. From my past jobs I have learned to handle difficult schedules and conflicts with other employees. At my current job I am responcible for setting up the majority of exents.",
  "Skills": ["Circuit python", " Java", " Micropython", " Circuit design and analysis"],
  "SkillsText": "Outside of employment related skills I play chess at a relativly high level, I am CPR certified, and I am an eagle scout.",
  "Resume": "Isaac Fuchs Resume (1).pdf"  
},
"Project1": {
    "Title": "Drone with automatic stabalizing camera",
    "Desc": "I was one of four team members who designed and built a FPV drone. We used a software called Betaflight to program it, and desgined a custom 3D printed chassis. The automaticly stabalizing camera was done through legacy features in Betaflight.",
    "GitHubRepo": "",
    "MainImage": "Screenshot 2025-12-07 163113.png",
    "DetailImages": []
  },
  "Project2": {
    "Title": "Mobile Electronic Construction Sign",
    "Desc": "The Mobile Electronic Construction Sign or MECS, is a remote controller rover designed to fulfill the role of traffic flaggers. The rover utilizes a 4 degree of freedom robotic arm to lift a LED sign into a position where it is easily readable. It is currently in prototyping stages with each major subsystem being tested seperatly. I am in charge of the programming for the rover.<br><br> More details can be found in the screenshots.",
    "GitHubRepo": "",
    "MainImage": "Image (4).jpg",
    "DetailImages": ["Screenshot 2025-12-07 170250.png","Screenshot 2025-12-07 170233.png","Screenshot 2025-12-07 170208.png"]
  },
  "Project3": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
